import pygame
from modules.level_map import screen, screen_height, screen_width

class Text():
    def __init__(self, text, color, size):
        self.text = text
        self.color = color
        self.font = pygame.font.SysFont('comicsansms', size)
        self.hitbox = None
        self.counter = 0
        if type(text) == list:
            self.width = self.font.size(text[0])[0]
            self.height = self.font.size(text[0])[1]
        self.text_list = text
        self.loading_image = pygame.image.load('images/__game_picture__/download_background2.png')
        self.loading_image = pygame.transform.scale(self.loading_image, (screen_width, screen_height))

    def draw_text(self, counter, x, y):
        for text in self.text[counter]:
            self.hitbox = self.font.render(text, True, self.color)
            screen.blit(self.hitbox, ((screen_width-self.font.size(text)[0])/2, y))
            y += screen_height*0.042
    
    def draw_game_text(self, x, y):
        self.width = self.font.size(self.text_list[0])[0]
        self.height = self.font.size(self.text_list[0])[1]
        for text in self.text_list:
            self.hitbox = self.font.render(text, True, self.color)
            screen.blit(self.hitbox, (x, y))
            y += 35

    def draw_credits_text(self, y):
      for text in self.text_list:
          self.hitbox = self.font.render(text, True, self.color)
          screen.blit(self.hitbox, ((screen_width-self.font.size(text)[0])/2, y))
          y += screen_height*0.051

text = Text(
    {
      #------------------------------Dialog 1-------------------------------------

    

      1 : ["Головний Ельф:",
          "Шановні ельфи. У мене для вас погані",
          "новини."],

      2 : ["Головний Ельф:",
            "Кхм... Кхм..."],

      3 : ["Головний Ельф:","Санта захворів. Нам треба",
          "йому допомогти, щоб зустріти Новий Рік!"],

      4 : ["Головний Ельф:",
          "Так. Олег, Катя та Микола. Ви йдете до",
          "Санти, і він особисто дасть вам завдання."],

      5 : ["Головний Ельф:",
          "Решта зі мною."],

      #------------------------------------------------------------------------
    },
    (200,200,200), int(screen_width*0.021))

text2 = Text(
    {
      #------------------------------Dialog 2-----------------------------
      1 : ['Микола:',
          'Санта, Ви нас викликали?'],
      
      2 : ['Санта:',
          'Так, потрібна ваша допомога.'],

      3 : ['Катя:',
          'Чим ми можемо Вам допомогти?'],

      4 : ['Санта:',
          'Я дам для кожного завдання і ви повинні',
          'його виконати.'],

      5 : ['Санта:',
          'Так.'],

      6 : ['Санта:',
          'Олег. Ти повинен забрати всі',
          'подарунки, що залишилися на складі.'],

      7 : ['Санта:',
          'Їх 10 штук, якщо правильно пам`ятаю'],

      8 : ['Санта:',
          'Ти впораєшся з цим?'],

      9 : ['Олег:',
          'Так, звичайно, все буде зроблено у',
          'найкращому вигляді.'],

      10 : ['Санта:',
            'Добре.'],

      11 : ['Санта:',
            'Тепер ти Катерино.'],

      12 : ['Санта:',
            'Йди теж до складу. Збери все для чаю.',
            "Лист чаю, воду, варення, чайник, чашку",
            "та ягоди."],

      13 : ['Катя:',
            'Для якого чаю?'],

      14 : ['Санта:',
            'Це особливий чай, він послаблює',
            'хворобу та надає імунітет.'],

      15 : ['Катя:',
            'Ого, прикольно.'],

      16 : ['Санта:',
            'Так, і я тебе прошу зробити цей чай.'],

      17 : ['Катя:',
            'А я впораюся?'],

      18 : ['Санта:',
            'Звичайно впораєшся, це як звичайний чай,',
            'тільки робиться у спеціальному чайнику.'],

      19 : ['Катя:',
            'Ага, зрозуміла, тоді зроблю!'],

      20 : ['Санта:',
            'Так. Тепер Микола.'],

      21 : ['Микола:',
            'Так, слухаю вас.'],

      22 : ['Санта:',
            'Мені якийсь Дмитро, який називає',
            'себе Сергієм.'],

      23 : ['Санта:',
            'Замовив одну річ.'],

      24 : ['Микола:',
            'І що ж?'],

      25 : ['Санта:',
            'Це торішній хліб.'],

      26 : ['Микола:',
            '???'],

      27 : ['Олег:',
            'Хахаха.'],

      28 : ['Катя:',
            'А я бачу він гуморист.'],
      
      29 : ['Санта:',
            'Так. Ну якщо вже замовив, то треба',
            'доставити.'],

      30 : ['Микола:',
            'Але як мені його дістати?'],

      31 : ['Санта:',
            'Ти маєш на санях прилетіти на Землю.'],

      32 : ['Санта:',
            'Я тобі дам карту.'],

      33 : ['Санта:',
            'Потім непомітно треба',
            'дістатися до одного місця.'],

      34 : ['Санта:',
            'Забереш хліб, та залишиш там',
            '50 новодоларів.'],

      35 : ['Санта:',
            'Я дам тобі гроші.'],

      36 : ['Санта:',
            'Ти мене зрозумів?'],

      37 : ['Микола:',
            'Так. Зрозумів.'],

      38 : ['Санта:',
            'Ну і коли свої справи зробите, повертайтесь',
            'назад до мене.'],

      39 : ['Санта:',
            'Хай щастить.']
    }, 
    (200,200,200), int(screen_width*0.021))

text3 = Text(
    {
      #------------------------------Dialog 3-----------------------------
      1 : ['Санта:','Ну що ж.'],
      
      2 : ['Санта:','Дякую Каті за чай.',
        'Він був дуже смачним.'],

      3 : ['Санта:',
      'Та всім іншим.'],

      4 : ['Олег:','Завжди будь ласка.'],

      5 : ['Катя:','Ми завжди раді вам допомогти.'],

      6 : ['Санта:','Це добре.'],

      7 : ['Санта:','Микола. Як покатався на санях?'],

      8 : ['Микола:','Дуже круто!',
        'Хочу ще.'],

      9 : ['Санта:','Хо-хо-хо. Я й не сумніваюся.'],

      10 : ['Санта:','Ну що ж, ще раз',
        'дякую за допомогу.'],

      11 : ['Санта:','Але мені час йти.'],

      12 : ['Олег:','Куди?'],

      13 : ['Санта:','У мене ще одне ',
        'замовлення є особливе.'],

      14 : ['Катя:','Так ви ж хворієте.',
        'Вам краще залишатись тут.'],

      15 : ['Микола:','Давайте краще ми.'],

      16 : ['Санта:','Хо-хо-хо, мені вже краще, та я ',
        'хочу особисто доставити це одній людині.'],

      17 : ['Санта:',
      "Гаразд дорогі ельф'ята, мені ",
        'час, відзначте цей Новий Рік добре.'],

      18 : ['Олег:','Добре, дякую'],

      19 : ['Катя:','На все добре.'],

      20 : ['Микола:','До побачення!']

    },
    (200,200,200), int(screen_width*0.021))

credits_text = Text([
      "Christmas Adventure 2023",
      "-----------------------------------------",
      "",
      "Сценарист:",
      "",
      "Мамедов Артур",
      "",
      "",
      "",
      "",
      "",
      "Программісти:",
      "",
      "",
      "Іванов Максим",
      "",
      "Мамедов Артур",
      "",
      "Андросов Данило",
      "",
      "Сенчішин Артем",
      "",
      "Кравчук Андрій",
      "",
      "",
      "",
      "",
      "",
      "Дизайнери:",
      "",
      "",
      "Чекаліна Тома",
      "",
      "Мамедов Артур",
      "",
      "Бабай Роман",
      "",
      "",
      "",
      "",
      "",
      "Звукорежисери:",
      "",
      "",
      "Андросов Данило",
      "",
      "Мамедов Артур",
      "",
      "Іванов Максим",
      "",
      "",
      "",
      "",
      "",
      "Проектувальники:",
      "",
      "",
      "Косьмінін Сергій",
      "",
      "Мамедов Артур",
      "",
      "Кравчук Андрій",
      "",
      "Андросов Данило",
      "",
      "",
      "",
      "",
      "",
      "Члени команди:",
      "",
      "",
      "Мамедов Артур",
      "",
      "Іванов Максим",
      "",
      "Чекаліна Тома",
      "",
      "Андросов Данило",
      "",
      "Сенчішин Артем",
      "",
      "Косьмін Сергій",
      "",
      "Кравчук Андрій",
      "",
      "Бабай Рома",
      "",
      "",
      "",
      "",
      "",
      "Музикальні композиції:",
      "",
      "",
      "Only Clear Minds · Tripchanski",
      "",
      "No More · Tripchanski",
      "",
      "Dialog · Bandlab AI",
      "",
      "Game 1 · Bandlab AI",
      "",
      "Game 2 · Bandlab AI",
      "",
      "Game 3 · Bandlab AI",
      "",
      "",
      "",
      "",
      "",
      "Звуки:",
      "",
      "",
      "Усі звуки · pixabay",
      "",
      "",
      "",
      "",
      "",
      "Remake:",
      "",
      "",
      "by Tripchanski",

    ],
    (255,255,255), int(screen_width*0.026))